# Pnadas dataframe

- It is like a 2D array
- It can be considered as an excel table
- It is the collection of rows and columns

# Creation of dataframe
 Syntax: pd.dataframe()

- Using a 2D list 
- Using a dictionary (Preferred)
- Using series

## Creation of DF using a 2D list

In [3]:
names = ('A', 'B', 'C', 'D', 'E', 'F')
id = [101, 102, 103, 104, 105, 106]
city = ['Bangalore','Delhi', 'Noida', 'Pune', 'Chennai', 'Hyd']

In [4]:
lst2d = [names, id, city]

In [5]:
import pandas as pd

pd.DataFrame(lst2d)

           0      1      2     3        4    5
0          A      B      C     D        E    F
1        101    102    103   104      105  106
2  Bangalore  Delhi  Noida  Pune  Chennai  Hyd

In [4]:
df = pd.DataFrame(lst2d).T  #Transpose
df

   0    1          2
0  A  101  Bangalore
1  B  102      Delhi
2  C  103      Noida
3  D  104       Pune
4  E  105    Chennai
5  F  106        Hyd

In [8]:
df.columns=['Name','ID', 'City']
df

  Name   ID       City
0    A  101  Bangalore
1    B  102      Delhi
2    C  103      Noida
3    D  104       Pune
4    E  105    Chennai
5    F  106        Hyd

In [10]:
#Another way of creating DF

lst = [ ['A',101, 'Bangalore'], ['B',102, 'Delhi'], ['C', 103, 'Noida'], ['D', 104, 'Pune'], ['E', 105, 'Channai'], ['F', 106, 'Hyd'] ]
pd.DataFrame(lst, columns=['Name','ID', 'City'])

  Name   ID       City
0    A  101  Bangalore
1    B  102      Delhi
2    C  103      Noida
3    D  104       Pune
4    E  105    Channai
5    F  106        Hyd

## Creation of DF using a dictionary

- keys of dict becomes column names in a dataframe

In [5]:
emp={'Name':['A', 'B', 'C', 'D', 'E', 'F'], 
     'ID': [101, 102, 103, 104, 105, 106],
     'City': ['Bangalore','Delhi', 'Noida', 'Pune', 'Chennai', 'Hyd']
     }

In [6]:
empdf = pd.DataFrame(emp)
empdf

  Name   ID       City
0    A  101  Bangalore
1    B  102      Delhi
2    C  103      Noida
3    D  104       Pune
4    E  105    Chennai
5    F  106        Hyd

## Creation of DF using a series

In [16]:
# names = ('A', 'B', 'C', 'D', 'E', 'F')
# id = [101, 102, 103, 104, 105, 106]
# city = ['Bangalore','Delhi', 'Noida', 'Pune', 'Chennai', 'Hyd']

s1 = pd.Series(['A', 'B', 'C', 'D', 'E', 'F'])
s1.name = 'EmpNames'
s1

s2 = pd.Series([101, 102, 103, 104, 105, 106])

In [18]:
# When creating muktiple series, use them within a container. If not second series will become column name
# if series name is defined, no need to define column name for dataframe
emp_df = pd.DataFrame([s1, s2])
emp_df

             0    1    2    3    4    5
EmpNames     A    B    C    D    E    F
Unnamed 0  101  102  103  104  105  106

In [17]:
emp_df = pd.DataFrame([s1, s2]).T
emp_df

  EmpNames Unnamed 0
0        A       101
1        B       102
2        C       103
3        D       104
4        E       105
5        F       106

In [19]:
type(emp_df)

pandas.core.frame.DataFrame

In [20]:
type(s1)

pandas.core.series.Series

Date: May 5
# Attributes on dataframe

1. shape
2. size: Total elements in the dataframe
3. dtypes
4. ndim
5. index
6. values
7. columns

In [7]:
empdf

  Name   ID       City
0    A  101  Bangalore
1    B  102      Delhi
2    C  103      Noida
3    D  104       Pune
4    E  105    Chennai
5    F  106        Hyd

In [9]:
empdf.shape

(6, 3)

In [10]:
empdf.size

18

In [11]:
empdf.dtypes

Name    object
ID       int64
City    object
dtype: object

In [12]:
empdf.ndim

2

In [13]:
empdf.index

RangeIndex(start=0, stop=6, step=1)

In [14]:
empdf.values

array([['A', 101, 'Bangalore'],
       ['B', 102, 'Delhi'],
       ['C', 103, 'Noida'],
       ['D', 104, 'Pune'],
       ['E', 105, 'Chennai'],
       ['F', 106, 'Hyd']], dtype=object)

In [15]:
empdf.columns

Index(['Name', 'ID', 'City'], dtype='object')

# Slicing and Indexing of dataframe

Indexing types
1. Implicit (python defined - iloc)
2. Explicit index (user defined/labels - loc)

In [16]:
empdf.iloc[0]

Name            A
ID            101
City    Bangalore
Name: 0, dtype: object

In [17]:
empdf.index = empdf.ID  #Assigned ID column to index
empdf

    Name   ID       City
ID
101    A  101  Bangalore
102    B  102      Delhi
103    C  103      Noida
104    D  104       Pune
105    E  105    Chennai
106    F  106        Hyd

In [18]:
empdf.iloc[0]

Name            A
ID            101
City    Bangalore
Name: 101, dtype: object

In [19]:
empdf.loc[101]

Name            A
ID            101
City    Bangalore
Name: 101, dtype: object

In [21]:
empdf.iloc[-1]

Name      F
ID      106
City    Hyd
Name: 106, dtype: object

In [24]:
df.iloc[4,2]

'Chennai'

In [25]:
empdf['ID']

ID
101    101
102    102
103    103
104    104
105    105
106    106
Name: ID, dtype: int64

#Slicing

In [26]:
#Fetch first 2 rows
empdf.iloc[0:2]

    Name   ID       City
ID
101    A  101  Bangalore
102    B  102      Delhi

In [27]:
empdf.loc[0:2] #loc only works on custom index, 102 and 103 are custom index

Empty DataFrame
Columns: [Name, ID, City]
Index: []

In [28]:
empdf.loc[101:102]

    Name   ID       City
ID
101    A  101  Bangalore
102    B  102      Delhi

In [29]:
#Get 3 rows and first 2 columns
empdf.iloc[0:3, 0:2]

    Name   ID
ID
101    A  101
102    B  102
103    C  103

In [32]:
empdf.iloc[::-1] #Reverse the columns in df

    Name   ID       City
ID
106    F  106        Hyd
105    E  105    Chennai
104    D  104       Pune
103    C  103      Noida
102    B  102      Delhi
101    A  101  Bangalore

In [33]:
empdf.iloc[::, ::-1] #Reverse the columns

          City   ID Name
ID
101  Bangalore  101    A
102      Delhi  102    B
103      Noida  103    C
104       Pune  104    D
105    Chennai  105    E
106        Hyd  106    F

In [34]:
#Reverse both rows and columns
empdf.iloc[::-1, ::-1]

          City   ID Name
ID
106        Hyd  106    F
105    Chennai  105    E
104       Pune  104    D
103      Noida  103    C
102      Delhi  102    B
101  Bangalore  101    A

## Accessing the columns

1. df['column_name']
2. df.'column_name'

## Accessing muktiple columns

1. df[['col1','col2']]
2. Not possible with dot operator

In [35]:
empdf['City']

ID
101    Bangalore
102        Delhi
103        Noida
104         Pune
105      Chennai
106          Hyd
Name: City, dtype: object

In [36]:
empdf.City

ID
101    Bangalore
102        Delhi
103        Noida
104         Pune
105      Chennai
106          Hyd
Name: City, dtype: object

In [38]:
empdf[['City','Name']]

          City Name
ID
101  Bangalore    A
102      Delhi    B
103      Noida    C
104       Pune    D
105    Chennai    E
106        Hyd    F

In [39]:
empdf.iloc[0:3]['City'] #get first 3 rows of city column

ID
101    Bangalore
102        Delhi
103        Noida
Name: City, dtype: object

# Importing excel and csv

In [42]:
ti_ds

,sex,age,sibsp,parch,fare,embarked,class,who,alone,survived
0,male,22.0,1,0,7.2500,S,Third,man,False,0
1,female,38.0,1,0,71.2833,C,First,woman,False,1
2,female,26.0,0,0,7.9250,S,Third,woman,True,1
3,female,35.0,1,0,53.1000,S,First,woman,False,1
4,male,35.0,0,0,8.0500,S,Third,man,True,0
...,...,...,...,...,...,...,...,...,...,...
886,male,27.0,0,0,13.0000,S,Second,man,True,0
887,female,19.0,0,0,30.0000,S,First,woman,True,1
888,female,NaN,1,2,23.4500,S,Third,woman,False,0
889,male,26.0,0,0,30.0000,C,First,man,True,1
890,male,32.0,0,0,7.7500,Q,Third,man,True,0

In [43]:
ti_ds.shape

(891, 10)

In [44]:
ti_ds.dtypes

sex          object
age         float64
sibsp         int64
parch         int64
fare        float64
embarked     object
class        object
who          object
alone          bool
survived      int64
dtype: object

In [45]:
ti_ds.index

RangeIndex(start=0, stop=891, step=1)

# Functions on dataframe

1. head(): Returns first 5 rows of the dataframe
2. tail: Returns last 5 rows of the dataframe
3. info(): returns some basic information about the dataframe
4. describe(): It returns the statistical summary of numeric columns
5. nunique(): It returns number of unique values in each column in a dataframe
6. unique(): It returns unique values in a particular dataframe
7. value_counts(): It returns the count of each unique value inside a column.

In [46]:
ti_ds.head()

      sex   age  sibsp  parch     fare embarked  class    who  alone  survived
0    male  22.0      1      0   7.2500        S  Third    man  False         0
1  female  38.0      1      0  71.2833        C  First  woman  False         1
2  female  26.0      0      0   7.9250        S  Third  woman   True         1
3  female  35.0      1      0  53.1000        S  First  woman  False         1
4    male  35.0      0      0   8.0500        S  Third    man   True         0

In [47]:
ti_ds.head(8)

      sex   age  sibsp  parch     fare embarked  class    who  alone  survived
0    male  22.0      1      0   7.2500        S  Third    man  False         0
1  female  38.0      1      0  71.2833        C  First  woman  False         1
2  female  26.0      0      0   7.9250        S  Third  woman   True         1
3  female  35.0      1      0  53.1000        S  First  woman  False         1
4    male  35.0      0      0   8.0500        S  Third    man   True         0
5    male   NaN      0      0   8.4583        Q  Third    man   True         0
6    male  54.0      0      0  51.8625        S  First    man   True         0
7    male   2.0      3      1  21.0750        S  Third  child  False         0

In [48]:
ti_ds.tail()

,sex,age,sibsp,parch,fare,embarked,class,who,alone,survived
886,male,27.0,0,0,13.00,S,Second,man,True,0
887,female,19.0,0,0,30.00,S,First,woman,True,1
888,female,NaN,1,2,23.45,S,Third,woman,False,0
889,male,26.0,0,0,30.00,C,First,man,True,1
890,male,32.0,0,0,7.75,Q,Third,man,True,0

In [49]:
ti_ds.columns

Index(['sex', 'age', 'sibsp', 'parch', 'fare', 'embarked', 'class', 'who',
       'alone', 'survived'],
      dtype='object')

In [50]:
ti_ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   sex       891 non-null    object
 1   age       714 non-null    float64
 2   sibsp     891 non-null    int64
 3   parch     891 non-null    int64
 4   fare      891 non-null    float64
 5   embarked  889 non-null    object
 6   class     891 non-null    object
 7   who       891 non-null    object
 8   alone     891 non-null    bool
 9   survived  891 non-null    int64
dtypes: bool(1), float64(2), int64(3), object(4)
memory usage: 63.6+ KB

In [51]:
ti_ds.describe() #It automatically selects only numeric values, object values skipped

              age       sibsp       parch        fare    survived
count  714.000000  891.000000  891.000000  891.000000  891.000000
mean    29.699118    0.523008    0.381594   32.204208    0.383838
std     14.526497    1.102743    0.806057   49.693429    0.486592
min      0.420000    0.000000    0.000000    0.000000    0.000000
25%     20.125000    0.000000    0.000000    7.910400    0.000000
50%     28.000000    0.000000    0.000000   14.454200    0.000000
75%     38.000000    1.000000    0.000000   31.000000    1.000000
max     80.000000    8.000000    6.000000  512.329200    1.000000

In [54]:
#Get 5th, 10th anf 99th percentile values
ti_ds.describe(percentiles=[.05, .1, .99])

              age       sibsp       parch        fare    survived
count  714.000000  891.000000  891.000000  891.000000  891.000000
mean    29.699118    0.523008    0.381594   32.204208    0.383838
std     14.526497    1.102743    0.806057   49.693429    0.486592
min      0.420000    0.000000    0.000000    0.000000    0.000000
5%       4.000000    0.000000    0.000000    7.225000    0.000000
10%     14.000000    0.000000    0.000000    7.550000    0.000000
50%     28.000000    0.000000    0.000000   14.454200    0.000000
99%     65.870000    5.000000    4.000000  249.006220    1.000000
max     80.000000    8.000000    6.000000  512.329200    1.000000

# Getting the percentile values

1. np.percentile()
2. df.col.quantile

In [56]:
#np.percentile()
#df.col.quantile

import numpy as np
np.percentile(ti_ds.fare, [25,75,99,100])

array([  7.9104 ,  31.     , 249.00622, 512.3292 ])

In [58]:
ti_ds.fare.quantile(0.50)

14.4542

In [59]:
ti_ds.nunique()

sex           2
age          88
sibsp         7
parch         7
fare        248
embarked      3
class         3
who           3
alone         2
survived      2
dtype: int64

In [64]:
ti_ds.who.unique()

array(['man', 'woman', 'child'], dtype=object)

In [65]:
ti_ds.who.value_counts()

man      537
woman    271
child     83
Name: who, dtype: int64

# Handling null values 

1. isna()
2. isnull()

In [67]:
ti_ds.isna().sum() #Gives number of null values in each column

sex           0
age         177
sibsp         0
parch         0
fare          0
embarked      2
class         0
who           0
alone         0
survived      0
dtype: int64

In [69]:
ti_ds.isnull().sum() #Same output as above

sex           0
age         177
sibsp         0
parch         0
fare          0
embarked      2
class         0
who           0
alone         0
survived      0
dtype: int64

# Filling the null values 

1. fillna(value) : filling all null values with some value
2. dropna : It removes all the rows that have atleast 1 null/nan value

In [70]:
#Fill null values by mean value in age column

ti_ds.age.fillna(ti_ds.age.mean()) #It does not make the changes in existing array
ti_ds.isnull().sum()

sex           0
age         177
sibsp         0
parch         0
fare          0
embarked      2
class         0
who           0
alone         0
survived      0
dtype: int64

In [71]:
ti_ds.age.fillna(ti_ds.age.mean(), inplace=True) #It make changes final
ti_ds.isnull().sum() #Now all age columns have no null values

sex         0
age         0
sibsp       0
parch       0
fare        0
embarked    2
class       0
who         0
alone       0
survived    0
dtype: int64

In [6]:
ti_ds = pd.read_csv("Titanic.csv")
print(ti_ds.isnull().sum())
print(ti_ds.shape)

sex           0
age         177
sibsp         0
parch         0
fare          0
embarked      2
class         0
who           0
alone         0
survived      0
dtype: int64
(891, 10)

In [84]:
ti_ds.dropna(inplace=True) #Making change final OR Assign back to df
#ti_ds = ti_ds.dropna() #Making change final by assigning the function to variable 
print(ti_ds.isnull().sum())
print(ti_ds.shape)

sex         0
age         0
sibsp       0
parch       0
fare        0
embarked    0
class       0
who         0
alone       0
survived    0
dtype: int64
(712, 10)

In [14]:
#Remove all 
ti_ds.dropna(how='all') #Removes rows where all column values are null
ti_ds.dropna(how='any') #Even if a single column is null in a row, the entire row is removed

,sex,age,sibsp,parch,fare,embarked,class,who,alone,survived
0,male,22.0,1,0,7.2500,S,Third,man,False,0
1,female,38.0,1,0,71.2833,C,First,woman,False,1
2,female,26.0,0,0,7.9250,S,Third,woman,True,1
3,female,35.0,1,0,53.1000,S,First,woman,False,1
4,male,35.0,0,0,8.0500,S,Third,man,True,0
...,...,...,...,...,...,...,...,...,...,...
886,male,27.0,0,0,13.0000,S,Second,man,True,0
887,female,19.0,0,0,30.0000,S,First,woman,True,1
888,female,NaN,1,2,23.4500,S,Third,woman,False,0
889,male,26.0,0,0,30.0000,C,First,man,True,1
890,male,32.0,0,0,7.7500,Q,Third,man,True,0

In [ ]:
ti_ds.dropna(thresh=2) #Drop those rows where atleast 2 columns are null

Date: May 8 
# Dropping the columns

In [8]:
#ti_ds.drop("parch", axis=1, inplace=True)

,sex,age,sibsp,parch,fare,embarked,class,who,alone,survived
0,male,22.0,1,0,7.2500,S,Third,man,False,0
1,female,38.0,1,0,71.2833,C,First,woman,False,1
2,female,26.0,0,0,7.9250,S,Third,woman,True,1
3,female,35.0,1,0,53.1000,S,First,woman,False,1
4,male,35.0,0,0,8.0500,S,Third,man,True,0
...,...,...,...,...,...,...,...,...,...,...
886,male,27.0,0,0,13.0000,S,Second,man,True,0
887,female,19.0,0,0,30.0000,S,First,woman,True,1
888,female,NaN,1,2,23.4500,S,Third,woman,False,0
889,male,26.0,0,0,30.0000,C,First,man,True,1
890,male,32.0,0,0,7.7500,Q,Third,man,True,0

In [ ]:
# To drop multiple col, pass them in a cntainer either a list or tuple
ti_ds.drop(["sex", "class"], axis=1, inplace=True)

# Renaming columns
Syntax: df.rename({'col_name':'new_name'}, axis=1, inplace=True)

In [10]:
ti_ds.rename({'parch':'parents'}, axis=1, inplace=True)

In [11]:
ti_ds

,sex,age,sibsp,parents,fare,embarked,class,who,alone,survived
0,male,22.0,1,0,7.2500,S,Third,man,False,0
1,female,38.0,1,0,71.2833,C,First,woman,False,1
2,female,26.0,0,0,7.9250,S,Third,woman,True,1
3,female,35.0,1,0,53.1000,S,First,woman,False,1
4,male,35.0,0,0,8.0500,S,Third,man,True,0
...,...,...,...,...,...,...,...,...,...,...
886,male,27.0,0,0,13.0000,S,Second,man,True,0
887,female,19.0,0,0,30.0000,S,First,woman,True,1
888,female,NaN,1,2,23.4500,S,Third,woman,False,0
889,male,26.0,0,0,30.0000,C,First,man,True,1
890,male,32.0,0,0,7.7500,Q,Third,man,True,0

# Data filteration by using conditions

Logical operators cannot work, use bit wise &,|,! operator

In [13]:
# To get all the recoards of passengers whoa re travelling in first class
ti_ds["class"]=='First'

0      False
1       True
2      False
3       True
4      False
       ...
886    False
887     True
888    False
889     True
890    False
Name: class, Length: 891, dtype: bool

In [14]:
ti_ds[ti_ds["class"]=='First']

,sex,age,sibsp,parents,fare,embarked,class,who,alone,survived
1,female,38.0,1,0,71.2833,C,First,woman,False,1
3,female,35.0,1,0,53.1000,S,First,woman,False,1
6,male,54.0,0,0,51.8625,S,First,man,True,0
11,female,58.0,0,0,26.5500,S,First,woman,True,1
23,male,28.0,0,0,35.5000,S,First,man,True,1
...,...,...,...,...,...,...,...,...,...,...
871,female,47.0,1,1,52.5542,S,First,woman,False,1
872,male,33.0,0,0,5.0000,S,First,man,True,0
879,female,56.0,0,1,83.1583,C,First,woman,False,1
887,female,19.0,0,0,30.0000,S,First,woman,True,1
889,male,26.0,0,0,30.0000,C,First,man,True,1

In [18]:
#EXtract peoplw travelling in First and Sceond class. Cover the conditions in parenthesis for multiple conditions

ti_ds[(ti_ds["class"]=='First') | (ti_ds["class"]=='First')]

,sex,age,sibsp,parents,fare,embarked,class,who,alone,survived
1,female,38.0,1,0,71.2833,C,First,woman,False,1
3,female,35.0,1,0,53.1000,S,First,woman,False,1
6,male,54.0,0,0,51.8625,S,First,man,True,0
11,female,58.0,0,0,26.5500,S,First,woman,True,1
23,male,28.0,0,0,35.5000,S,First,man,True,1
...,...,...,...,...,...,...,...,...,...,...
871,female,47.0,1,1,52.5542,S,First,woman,False,1
872,male,33.0,0,0,5.0000,S,First,man,True,0
879,female,56.0,0,1,83.1583,C,First,woman,False,1
887,female,19.0,0,0,30.0000,S,First,woman,True,1
889,male,26.0,0,0,30.0000,C,First,man,True,1

In [26]:
#Get the age of the passengers who are travelling in pclass third

ti_ds[ti_ds['class']=='Second'] [['age']]

      age
9    14.0
15   55.0
17    NaN
20   35.0
21   34.0
..    ...
866  27.0
874  28.0
880  25.0
883  28.0
886  27.0

[184 rows x 1 columns]

In [27]:
# Get the fare of the passengers who are travelling in plcass Second and are male

ti_ds[(ti_ds['class']=='Second') & (ti_ds['sex']=='male')][['sex']]

      sex
17   male
20   male
21   male
33   male
70   male
..    ...
848  male
861  male
864  male
883  male
886  male

[108 rows x 1 columns]

In [29]:
#Average face of all female passengers travelling in pclass Second
ti_ds[(ti_ds['class']=='Second') & (ti_ds['sex']=='female')][['fare']].mean()

fare    21.970121
dtype: float64

In [30]:
ti_ds[(ti_ds['class']=='Second') & (ti_ds['sex']=='female')][['fare']].sum()

fare    1669.7292
dtype: float64

# Group by function

- It is used to analyse two or more columns togather

syntax: df.groupby('col').col.operation

In [31]:
# Number of males and females who dies or survived
# cols involved = sex, survived (Both are categorical)
# Col kept inside will become index

ti_ds.groupby('sex').survived.value_counts()

sex     survived
female  1           233
        0            81
male    0           468
        1           109
Name: survived, dtype: int64

In [34]:
# Number of males/females who died/survuved in a pclass
# cols involved sex, survived, class

ti_ds.groupby(["sex","class"]).survived.value_counts()

sex     class   survived
female  First   1            91
                0             3
        Second  1            70
                0             6
        Third   0            72
                1            72
male    First   0            77
                1            45
        Second  0            91
                1            17
        Third   0           300
                1            47
Name: survived, dtype: int64

In [35]:
#Average age of male and female
ti_ds.groupby('sex').age.mean()

sex
female    27.915709
male      30.726645
Name: age, dtype: float64

In [36]:
# Average Fare and average age of male and female passengers travelling in plcass 2 
#fare(discrete), sex(categorical), class(categorical), age(categorical)
# Keep the columns on which you are performing operation outside
ti_ds.groupby(['sex','class'])[['fare','age']].mean()

                     fare        age
sex    class
female First   106.125798  34.611765
       Second   21.970121  28.722973
       Third    16.118810  21.750000
male   First    67.226127  41.281386
       Second   19.741782  30.740707
       Third    12.661633  26.507589

# Pivot table

- It is used to summarise the data
- syntax: d.pivot_table(index=, columns, values=, aggfunc= )

In [ ]:
#Region wise total sales
# region
# sales - operation - values

sls. pivot_table(index='Region', values='Sales', aggfunc=sum)

#### **Refer to records for remaining pivot table operations**

# Concatination of dataframes

Types
1. Vertical concatination
2. Horizontal concatination (Columns are different)

In [37]:
ti_ds = pd.read_csv("Titanic.csv")

In [38]:
names = ('A', 'B', 'C', 'D', 'E', 'F')
id = [101, 102, 103, 104, 105, 106]
city = ['Bangalore','Delhi', 'Noida', 'Pune', 'Chennai', 'Hyd']

df = pd.DataFrame({'Names':names, 'ID':id, 'City':city })
df.head()

  Names   ID       City
0     A  101  Bangalore
1     B  102      Delhi
2     C  103      Noida
3     D  104       Pune
4     E  105    Chennai

In [39]:
names = ('G', 'H', 'I')
id = [107, 108, 109]
city = ['Bangalore','Bangalore', 'Bangalore']

df2 = pd.DataFrame({'Names':names, 'ID':id, 'City':city })

In [42]:
df_final = pd.concat((df, df2), axis=0, ignore_index=True)
df_final

  Names   ID       City
0     A  101  Bangalore
1     B  102      Delhi
2     C  103      Noida
3     D  104       Pune
4     E  105    Chennai
5     F  106        Hyd
6     G  107  Bangalore
7     H  108  Bangalore
8     I  109  Bangalore

# Merging the dataframes

- For merginf one column should be common
- syntax: pd.merge(df_1, df_2, on=common_col, how=)

how:
1. inner = common observations from both df
2. left = All observations from left df
3. right = All observations from right df
4. outer = All observations from both df